{
  "id": "C1B2B69E-F28B-428E-88FC-61A2B9837021",
  "name": "Alcatraz Island (Test)",
  "description": "Welcome to Alcatraz Island, a haunting, mysterious place where history and danger collide. Set on a stormy night, the island is shrouded in mist, with the crashing waves of the San Francisco Bay surrounding its jagged cliffs. Once a high-security prison, Alcatraz now lies abandoned, but rumors persist that it holds more than just memories of its infamous past. As you explore the island, you'll encounter remnants of its dark history: rusting cellblocks, underground tunnels, and eerie watchtowers. Locked doors and hidden passageways guard ancient secrets, while strange phenomena suggest that the island is not as empty as it seems. The central fortress-like prison looms above, its walls covered in ivy and the occasional flicker of lights in the windows, despite being long deserted. Inside, traps, puzzles, and hidden rooms await, daring you to uncover the truth about the island’s darkest secrets. Along the way, you'll need to outsmart both natural hazards and shadowy figures that may or may not be real. From the desolate shoreline to the crumbling lighthouse, each part of Alcatraz Island tells a story, and not all are meant to be heard. Do you have what it takes to survive the island's hidden dangers and escape with your life?",
  "locations": [
    {
      "id": "B6666C4E-83C6-46CF-98FD-7A32C279D8B2",
      "name": "Forest Entrance",
      "description": "The entrance to a dark and mysterious forest.",
      "connections": [
        "9ED91E27-4B20-492B-AC82-BD30D0420B02",
        "04EECA7D-17B4-404D-912D-9170D2810292"
      ],
      "start": true
    },
    {
      "id": "9ED91E27-4B20-492B-AC82-BD30D0420B02",
      "name": "Deep Forest",
      "description": "Deeper into the forest, it gets darker.",
      "connections": [
        "B6666C4E-83C6-46CF-98FD-7A32C279D8B2"
      ]
    },
    {
      "id": "04EECA7D-17B4-404D-912D-9170D2810292",
      "name": "Village Road",
      "description": "The road leading back to the village.",
      "connections": [
        "B6666C4E-83C6-46CF-98FD-7A32C279D8B2"
      ]
    }
  ]
}